treno15_3mezze/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include       "include/angulationParameters"
#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    #include "include/fixedInlet"

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    lowerWall
    {
        type            fixedValue;
        value           $internalField;
    }
    
    treno15
    {
        type            noSlip;
    }

    pareti_galleria
    {
        type            noSlip;
    }
    pareti_avanti
    {
        type          slip;
    }
    
    pareti_dietro
    {
        type          slip;
    }


    #include "include/frontBackUpperPatches"

    //Redefinition of back and frontWall in case the angluationFlag is set to TRUE

    #ifeq $angulationFlag true
        #if #eval {$angulationAngle < 0}
            backWall
            {
                type  fixedValue;
                value $internalField;
            }
        #else
            backWall
            {
                type            inletOutlet;
                inletValue      uniform (0 0 0);
                value           $internalField;
            }
        #endif
        
        #if #eval {$angulationAngle > 0}
            frontWall
            {
                type  fixedValue;
                value $internalField;
            }
        #else
            frontWall
            {
                type            inletOutlet;
                inletValue      uniform (0 0 0);
                value           $internalField;
            }
        #endif
    #endif
}


// ************************************************************************* //
