treno15_3mezze/0.orig/include/pareti_Slip
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
pareti_avanti
{
    type slip;
}

pareti_dietro
{
    type slip;
}


// ************************************************************************* //
