treno15_3mezze/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    frontAndBack  //slip
    {
        type            calculated;
        value           uniform 0;
    }
   
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    lowerWall  //slip
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    upperWall //slip
    {
        type            calculated;
        value           uniform 0;
    }
    
    pareti_galleria
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    pareti_dietro //slip
    {
        type            calculated;
        value           uniform 0;
    }
    pareti_avanti //slip
    {
        type            calculated;
        value           uniform 0;
    }
    
    
    
    ///////////////////////




    Back
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    Upper
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    Front
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    treno15
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    pareti_galleria
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}

// ************************************************************************* //
