treno15_3mezze/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include       "include/angulationParameters"
#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    #include "include/fixedInlet"

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    lowerWall
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    treno15
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    pareti_galleria
    {
        type            omegaWallFunction;
        value           $internalField;   
    }
#include "include/pareti_Slip"
    #include "include/frontBackUpperPatches"

     // In case the angluationFlag is set to TRUE, the following patches are redefined
    #ifeq $angulationFlag true
        #if #eval {$angulationAngle < 0}
            backWall
            {
                type  fixedValue;
                value $internalField;
            }
        #else
            backWall
            {
                type            inletOutlet;
                inletValue      $internalField;
                value           $internalField;
            }
        #endif

        #if #eval {$angulationAngle > 0}
            frontWall
            {
                type  fixedValue;
                value $internalField;
            }
        #else
            frontWall
            {
                type            inletOutlet;
                inletValue      $internalField;
                value           $internalField;
            }
        #endif
    #endif
}


// ************************************************************************* //
